# Everything Strings

In [5]:
str_1 = 'python interview'
str_1[3]

'h'

In [4]:
len(str_1)

16

In [6]:
str_1[-3]

'i'

In [7]:
str_1[4:]

'on interview'

In [9]:
str_1[:6]

'python'

In [10]:
str_1.index('i')

7

In [12]:
# strings are immutable
str_1[2] = 's'

TypeError: 'str' object does not support item assignment

In [16]:
str_2 = ' is difficult'

In [17]:
str_3 = str_1 + str_2
str_3

'python interview is difficult'

In [19]:
str_4 = str_3.replace('python','sql')
str_4

'sql interview is difficult'

In [20]:
str_4.upper()

'SQL INTERVIEW IS DIFFICULT'

In [21]:
str_4.capitalize()

'Sql interview is difficult'

In [22]:
# create a string from a list of words
list_1 = ['I','love','reading','beauty','blogs']
str_5 = ' '.join(list_1)
str_5

'I love reading beauty blogs'

In [24]:
# breaking a string into a list of words
str_6 = 'mastering scales and arpegios in piona and violin takes a lot of practices and dedication.'
list_2 = str_6.split(' ')
list_2

['mastering',
 'scales',
 'and',
 'arpegios',
 'in',
 'piona',
 'and',
 'violin',
 'takes',
 'a',
 'lot',
 'of',
 'practices',
 'and',
 'dedication.']

## String methods with DataFrames

In [25]:
import pandas as pd

In [27]:
data = {'name':['andy','tanya','zoe'],'age':[39,27,30]}
df = pd.DataFrame(data)
df

    name  age
0   andy   39
1  tanya   27
2    zoe   30

In [29]:
df['name'] = df['name'].str.capitalize()
df

    name  age
0   Andy   39
1  Tanya   27
2    Zoe   30

In [30]:
df['name'] = df['name'].str.upper()
df

    name  age
0   ANDY   39
1  TANYA   27
2    ZOE   30